In [20]:
import pandas as pd
from datasets import load_dataset
import matplotlib.pyplot as plt

# Loading Data 
dataset = load_dataset('lukebarousse/data_jobs')
df = dataset['train'].to_pandas()
df_original = dataset['train'].to_pandas()

In [2]:
# median values
median_salary_hour = df['salary_hour_avg'].median()

In [3]:
median_salary_year = df['salary_year_avg'].median()

In [17]:
df_filled = df.copy()

df_filled['salary_year_avg'] = df_filled['salary_year_avg'].fillna(median_salary_year)
df_filled['salary_hour_avg'] = df_filled['salary_year_avg'].fillna(median_salary_hour)

In [8]:
df_filled.loc[:10, 'salary_rate':'salary_hour_avg']

   salary_rate  salary_year_avg  salary_hour_avg
0         None         115000.0         115000.0
1         None         115000.0         115000.0
2         None         115000.0         115000.0
3         None         115000.0         115000.0
4         None         115000.0         115000.0
5         None         115000.0         115000.0
6         None         115000.0         115000.0
7         None         115000.0         115000.0
8         None         115000.0         115000.0
9         None         115000.0         115000.0
10        None         115000.0         115000.0

In [11]:
df_unique = df_filled.drop_duplicates(subset=['job_title','company_name'])

#veamos cuantos valores se dropearon

print('Length before dropping duplicates:', len(df_filled))
print('Length after dropping duplicates:', len(df_unique))
print('Number of duplicates dropped:', len(df_filled) - len(df_unique))

Length before dropping duplicates: 785741
Length after dropping duplicates: 508042
Number of duplicates dropped: 277699

In [ ]:
df.sample(10, random_state=42) # Muestra una fila aleatoria del DataFrame

,job_title_short,job_title,job_location,job_via,job_schedule_type,job_work_from_home,search_location,job_posted_date,job_no_degree_mention,job_health_insurance,job_country,salary_rate,salary_year_avg,salary_hour_avg,company_name,job_skills,job_type_skills
279463,Data Analyst,Data Analyst,"Brussels, Belgium",via Trabajo.org,Full-time,False,Belgium,2023-08-25 07:21:09,False,False,Belgium,None,115000.0,115000.0,V-IT,"['sas', 'sas', 'sql', 'excel', 'power bi', 'ta...","{'analyst_tools': ['sas', 'excel', 'power bi',..."

In [24]:
#Si queremos crear un dataframe que sea una copia de otro dataframe, debemos usar el metodo copy() porque sino vamos a estar trabajando con referencias al mismo objeto en memoria.
df_copy = df_unique.copy()

median_salary_hour = df_copy['salary_hour_avg'].median()

df_copy.fillna(median_salary_hour, inplace=True)
len(df)
df_copy.loc[:5, 'salary_rate':'salary_hour_avg']

  salary_rate  salary_year_avg  salary_hour_avg
0    115000.0         115000.0         115000.0
1    115000.0         115000.0         115000.0
2    115000.0         115000.0         115000.0
3    115000.0         115000.0         115000.0
4    115000.0         115000.0         115000.0
5    115000.0         115000.0         115000.0

In [23]:
df_original.loc[:5, 'salary_rate':'salary_hour_avg']
len(df_original)

785741